results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf5-isr3-msg102400-tps1000-batch16384-acks1-prod6-complz4-trial1/producer-perf-4.log
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=167
1 records sent, 0.1 records/sec (0.01 MB/sec), 2680.0 ms avg latency, 2680.0 ms max latency.
156 records sent, 31.2 records/sec (3.05 MB/sec), 4737.2 ms avg latency, 8901.0 ms max latency.
288 records sent, 56.8 records/sec (5.55 MB/sec), 5391.2 ms avg latency, 6419.0 ms max latency.
294 records sent, 58.4 records/sec (5.70 MB/sec), 6092.5 ms avg latency, 6827.0 ms max latency.
745 records sent, 148.3 records/sec (14.48 MB/sec), 2491.0 ms avg latency, 5996.0 ms max latency.
595 records sent, 118.5 records/sec (11.57 MB/sec), 128.0 ms avg latency, 692.0 ms max latency.
554 records sent, 110.8 records/sec (10.82 MB/sec), 52.7 ms avg latency, 340.0 ms max latency.
601 records sent, 119.8 records/sec (11.70 MB/sec), 32.5 ms avg latency, 132.0 ms max latency.
618 records sent, 122.8 records/sec (11.99 MB/sec), 42.0 ms avg latency, 185.0 ms max latency.
643 records sent, 128.4 records/sec (12.54 MB/sec), 34.3 ms avg latency, 163.0 ms max latency.
681 records sent, 134.9 records/sec (13.17 MB/sec), 28.5 ms avg latency, 144.0 ms max latency.
626 records sent, 124.7 records/sec (12.18 MB/sec), 31.0 ms avg latency, 142.0 ms max latency.
644 records sent, 128.8 records/sec (12.58 MB/sec), 27.9 ms avg latency, 130.0 ms max latency.
641 records sent, 128.2 records/sec (12.52 MB/sec), 32.9 ms avg latency, 142.0 ms max latency.
630 records sent, 125.9 records/sec (12.30 MB/sec), 29.6 ms avg latency, 159.0 ms max latency.
621 records sent, 123.8 records/sec (12.09 MB/sec), 31.1 ms avg latency, 152.0 ms max latency.
662 records sent, 132.2 records/sec (12.91 MB/sec), 21.9 ms avg latency, 123.0 ms max latency.
657 records sent, 131.3 records/sec (12.82 MB/sec), 19.7 ms avg latency, 88.0 ms max latency.
622 records sent, 122.8 records/sec (11.99 MB/sec), 25.2 ms avg latency, 126.0 ms max latency.
718 records sent, 143.4 records/sec (14.00 MB/sec), 46.5 ms avg latency, 397.0 ms max latency.
728 records sent, 145.0 records/sec (14.16 MB/sec), 29.8 ms avg latency, 181.0 ms max latency.
696 records sent, 138.2 records/sec (13.49 MB/sec), 25.7 ms avg latency, 110.0 ms max latency.
640 records sent, 127.7 records/sec (12.47 MB/sec), 21.4 ms avg latency, 112.0 ms max latency.
708 records sent, 141.6 records/sec (13.83 MB/sec), 21.0 ms avg latency, 104.0 ms max latency.
699 records sent, 139.6 records/sec (13.64 MB/sec), 26.1 ms avg latency, 202.0 ms max latency.
763 records sent, 152.6 records/sec (14.90 MB/sec), 16.7 ms avg latency, 71.0 ms max latency.
916 records sent, 182.6 records/sec (17.83 MB/sec), 18.0 ms avg latency, 152.0 ms max latency.
16667 records sent, 116.985211 records/sec (11.42 MB/sec), 385.80 ms avg latency, 8901.00 ms max latency, 23 ms 50th, 4238 ms 95th, 6091 ms 99th, 6481 ms 99.9th.